# ExportLayerInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLayerInfo Properties
ExportLayerInfo Class See Also
---
The ExportLayerInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryType | The category type which this layer belongs to. |
| ColorName | The color name stored in value. For IFC export, the naming is to match the "colornumber" setting -- really, this stores a string that generates the colorNumber (for formats that don't use the color but need a second entry.) |
| ColorNumber | The color number stored in value. |
| CutColorNumber | The cut color number stored in value. |
| CutLayerName | The cut layer name stored in value. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LayerName | The layer name stored in value. |

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace